## Plan changes
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 8 to add, 31 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "ClaimedOneTimeCodeTotal" {
        id             = "ClaimedOneTimeCodeTotal0"
        name           = "ClaimedOneTimeCodeTotal0"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "ClaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[1] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "ClaimedOneTimeCodeTotal" {
        id             = "ClaimedOneTimeCodeTotal1"
        name           = "ClaimedOneTimeCodeTotal1"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "ClaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[2] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "ClaimedOneTimeCodeTotal" {
        id             = "ClaimedOneTimeCodeTotal2"
        name           = "ClaimedOneTimeCodeTotal2"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "ClaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[3] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "ClaimedOneTimeCodeTotal" {
        id             = "ClaimedOneTimeCodeTotal3"
        name           = "ClaimedOneTimeCodeTotal3"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "ClaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[4] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "ClaimedOneTimeCodeTotal" {
        id             = "ClaimedOneTimeCodeTotal4"
        name           = "ClaimedOneTimeCodeTotal4"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "ClaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[5] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "ClaimedOneTimeCodeTotal" {
        id             = "ClaimedOneTimeCodeTotal5"
        name           = "ClaimedOneTimeCodeTotal5"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "ClaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[6] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "ClaimedOneTimeCodeTotal" {
        id             = "ClaimedOneTimeCodeTotal6"
        name           = "ClaimedOneTimeCodeTotal6"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "ClaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[7] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "ClaimedOneTimeCodeTotal" {
        id             = "ClaimedOneTimeCodeTotal7"
        name           = "ClaimedOneTimeCodeTotal7"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "ClaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "DiagnosisKeyTotal" {
        id             = "DiagnosisKeyTotal0"
        name           = "DiagnosisKeyTotal0"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "DiagnosisKeyTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[1] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "DiagnosisKeyTotal" {
        id             = "DiagnosisKeyTotal1"
        name           = "DiagnosisKeyTotal1"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "DiagnosisKeyTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[2] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "DiagnosisKeyTotal" {
        id             = "DiagnosisKeyTotal2"
        name           = "DiagnosisKeyTotal2"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "DiagnosisKeyTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[3] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "DiagnosisKeyTotal" {
        id             = "DiagnosisKeyTotal3"
        name           = "DiagnosisKeyTotal3"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "DiagnosisKeyTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[4] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "DiagnosisKeyTotal" {
        id             = "DiagnosisKeyTotal4"
        name           = "DiagnosisKeyTotal4"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "DiagnosisKeyTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[5] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "DiagnosisKeyTotal" {
        id             = "DiagnosisKeyTotal5"
        name           = "DiagnosisKeyTotal5"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "DiagnosisKeyTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[6] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "DiagnosisKeyTotal" {
        id             = "DiagnosisKeyTotal6"
        name           = "DiagnosisKeyTotal6"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "DiagnosisKeyTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[7] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "DiagnosisKeyTotal" {
        id             = "DiagnosisKeyTotal7"
        name           = "DiagnosisKeyTotal7"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "DiagnosisKeyTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "UnclaimedOneTimeCodeTotal" {
        id             = "UnclaimedOneTimeCodeTotal0"
        name           = "UnclaimedOneTimeCodeTotal0"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "UnclaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[1] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "UnclaimedOneTimeCodeTotal" {
        id             = "UnclaimedOneTimeCodeTotal1"
        name           = "UnclaimedOneTimeCodeTotal1"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "UnclaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[2] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "UnclaimedOneTimeCodeTotal" {
        id             = "UnclaimedOneTimeCodeTotal2"
        name           = "UnclaimedOneTimeCodeTotal2"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "UnclaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[3] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "UnclaimedOneTimeCodeTotal" {
        id             = "UnclaimedOneTimeCodeTotal3"
        name           = "UnclaimedOneTimeCodeTotal3"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "UnclaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[4] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "UnclaimedOneTimeCodeTotal" {
        id             = "UnclaimedOneTimeCodeTotal4"
        name           = "UnclaimedOneTimeCodeTotal4"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "UnclaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[5] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "UnclaimedOneTimeCodeTotal" {
        id             = "UnclaimedOneTimeCodeTotal5"
        name           = "UnclaimedOneTimeCodeTotal5"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "UnclaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[6] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "UnclaimedOneTimeCodeTotal" {
        id             = "UnclaimedOneTimeCodeTotal6"
        name           = "UnclaimedOneTimeCodeTotal6"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "UnclaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[7] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "UnclaimedOneTimeCodeTotal" {
        id             = "UnclaimedOneTimeCodeTotal7"
        name           = "UnclaimedOneTimeCodeTotal7"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "UnclaimedOneTimeCodeTotal"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.error_logged will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "error_logged" {
        id             = "ErrorLogged"
        name           = "ErrorLogged"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "ErrorLogged"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.fatal_logged will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "fatal_logged" {
        id             = "FatalLogged"
        name           = "FatalLogged"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "FatalLogged"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.five_hundred_response will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "five_hundred_response" {
        id             = "500Response"
        name           = "500Response"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "500Response"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.key_clear_called will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "key_clear_called" {
        id             = "KeyClearCalled"
        name           = "KeyClearCalled"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "KeyClearCalled"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.unauthorized_new_one_time_code_requests will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "unauthorized_new_one_time_code_requests" {
        id             = "UnauthorizedNewOneTimeCodeRequests"
        name           = "UnauthorizedNewOneTimeCodeRequests"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "UnauthorizedNewOneTimeCodeRequests"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.unauthorized_one_time_code_claim_requests will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "unauthorized_one_time_code_claim_requests" {
        id             = "UnauthorizedOneTimeCodeClaimRequests"
        name           = "UnauthorizedOneTimeCodeClaimRequests"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "UnauthorizedOneTimeCodeClaimRequests"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_metric_filter.unauthorized_upload_requests will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "unauthorized_upload_requests" {
        id             = "UnauthorizedUploadRequests"
        name           = "UnauthorizedUploadRequests"
        # (2 unchanged attributes hidden)

      ~ metric_transformation {
            name       = "UnauthorizedUploadRequests"
          + unit       = "None"
            # (3 unchanged attributes hidden)
        }
    }

  # module.ops_alarms.aws_cloudwatch_log_metric_filter.user_alarm_failure["ops1"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_failure" {
      + id             = (known after apply)
      + log_group_name = "CloudTrail/Landing-Zone-Logs"
      + name           = "ops1_ConsoleLogin_Failure"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"ops1\" && $.responseElements.ConsoleLogin = \"Failure\" }"

      + metric_transformation {
          + name      = "ops1_ConsoleLogin_Failure"
          + namespace = "common-metrics"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.ops_alarms.aws_cloudwatch_log_metric_filter.user_alarm_failure["ops2"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_failure" {
      + id             = (known after apply)
      + log_group_name = "CloudTrail/Landing-Zone-Logs"
      + name           = "ops2_ConsoleLogin_Failure"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"ops2\" && $.responseElements.ConsoleLogin = \"Failure\" }"

      + metric_transformation {
          + name      = "ops2_ConsoleLogin_Failure"
          + namespace = "common-metrics"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.ops_alarms.aws_cloudwatch_log_metric_filter.user_alarm_success["ops1"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_success" {
      + id             = (known after apply)
      + log_group_name = "CloudTrail/Landing-Zone-Logs"
      + name           = "ops1_ConsoleLogin_Success"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"ops1\" && $.responseElements.ConsoleLogin = \"Success\" }"

      + metric_transformation {
          + name      = "ops1_ConsoleLogin_Success"
          + namespace = "common-metrics"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.ops_alarms.aws_cloudwatch_log_metric_filter.user_alarm_success["ops2"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_success" {
      + id             = (known after apply)
      + log_group_name = "CloudTrail/Landing-Zone-Logs"
      + name           = "ops2_ConsoleLogin_Success"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"ops2\" && $.responseElements.ConsoleLogin = \"Success\" }"

      + metric_transformation {
          + name      = "ops2_ConsoleLogin_Success"
          + namespace = "common-metrics"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.ops_alarms.aws_cloudwatch_metric_alarm.alarm_failure["ops1"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_failure" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-warning",
        ]
      + alarm_name                            = "ops1_ConsoleLogin_Failure_alarm_failure"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ops1_ConsoleLogin_Failure"
      + namespace                             = "common-metrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 3
      + treat_missing_data                    = "notBreaching"
    }

  # module.ops_alarms.aws_cloudwatch_metric_alarm.alarm_failure["ops2"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_failure" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-warning",
        ]
      + alarm_name                            = "ops2_ConsoleLogin_Failure_alarm_failure"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ops2_ConsoleLogin_Failure"
      + namespace                             = "common-metrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 3
      + treat_missing_data                    = "notBreaching"
    }

  # module.ops_alarms.aws_cloudwatch_metric_alarm.alarm_success["ops1"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_success" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-critical",
        ]
      + alarm_name                            = "ops1_ConsoleLogin_Success_alarm_success"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ops1_ConsoleLogin_Success"
      + namespace                             = "common-metrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ops_alarms.aws_cloudwatch_metric_alarm.alarm_success["ops2"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_success" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:005133826942:alert-critical",
        ]
      + alarm_name                            = "ops2_ConsoleLogin_Success_alarm_success"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ops2_ConsoleLogin_Success"
      + namespace                             = "common-metrics"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

Plan: 8 to add, 31 to change, 0 to destroy.

Changes to Outputs:
  ~ aws_db_subnet_group          = {
      + tags_all    = {
          + "CostCentre" = "CovidShield"
          + "Name"       = "server"
        }
        # (7 unchanged elements hidden)
    }
  ~ cloudwatch_log_group         = {
      + tags_all          = {
          + "CostCentre" = "CovidShield"
        }
        # (7 unchanged elements hidden)
    }
  ~ ecs_cluster                  = {
      + configuration                      = []
      + tags_all                           = {
          + "CostCentre" = "CovidShield"
        }
        # (7 unchanged elements hidden)
    }
  ~ route53_zone                 = {
      + tags_all          = {
          + "CostCentre" = "CovidShield"
        }
        # (9 unchanged elements hidden)
    }
  ~ security_group_load_balancer = {
      + tags_all               = {
          + "CostCentre" = "CovidShield"
        }
        # (12 unchanged elements hidden)
    }

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>